{"keras_version": "2.2.0", "backend": "tensorflow", "config": [{"config": {"activity_regularizer": null, "dilation_rate": [1, 1], "filters": 32, "dtype": "float32", "bias_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3], "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "strides": [1, 1], "trainable": true, "name": "conv2d_11", "kernel_constraint": null, "activation": "relu", "padding": "valid", "batch_input_shape": [null, 1, 28, 28], "data_format": "channels_first", "use_bias": true}, "class_name": "Conv2D"}, {"config": {"strides": [2, 2], "name": "max_pooling2d_7", "trainable": true, "padding": "valid", "pool_size": [2, 2], "data_format": "channels_first"}, "class_name": "MaxPooling2D"}, {"config": {"activity_regularizer": null, "dilation_rate": [1, 1], "filters": 64, "bias_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3], "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "strides": [1, 1], "trainable": true, "name": "conv2d_12", "kernel_constraint": null, "activation": "relu", "padding": "valid", "data_format": "channels_first", "use_bias": true}, "class_name": "Conv2D"}, {"config": {"strides": [2, 2], "name": "max_pooling2d_8", "trainable": true, "padding": "valid", "pool_size": [2, 2], "data_format": "channels_first"}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_4", "data_format": "channels_first", "trainable": true}, "class_name": "Flatten"}, {"config": {"activity_regularizer": null, "units": 128, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "trainable": true, "name": "dense_7", "kernel_constraint": null, "activation": "relu", "kernel_regularizer": null, "use_bias": true}, "class_name": "Dense"}, {"config": {"activity_regularizer": null, "units": 27, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "trainable": true, "name": "dense_8", "kernel_constraint": null, "activation": "softmax", "kernel_regularizer": null, "use_bias": true}, "class_name": "Dense"}], "class_name": "Sequential"}